{"pageProps":{"postData":{"id":"dependencies","contentHtml":"<p>My current role is focused on improving the (web) performance of <a href=\"https://www.atlassian.com/software/confluence\">Confluence at Atlassian</a>.\nOne of the most obvious ways to improve performance is to reduce the amount of JavaScript code we're sending down to the client;\nand, one of the largest offenders of excess JavaScript is 3rd party dependencies.\nLet's talk about how we can tackle optimizing our dependencies.</p>\n<hr>\n<p>Familiar with dependencies? Feel free to skip to the practical sections, starting with <a href=\"#user-content-auditing-dependencies\">Auditing project dependencies</a></p>\n<hr>\n<h1 id=\"user-content-id1\">What is a dependency?</h1>\n<p>Starting with the basics, a dependency is a reusable bundle of code that does something.\nThis means dependents don't have to write the code themselves to do that aforementioned something.\nFor a myriad of reasons (development speed, domain knowledge, robustness, or just plain laziness), we as developers end up pulling in lots of dependencies.\nComplexity with your dependency tree creeps in when your dependencies have dependencies. These nested dependencies are called transitive dependencies.</p>\n<h1 id=\"user-content-id2\">Declarations and versioning</h1>\n<p>Dependencies are declared in the <code>package.json</code> file.\nThis is also where we define what range of versions are acceptable.</p>\n<h2 id=\"user-content-id3\">Version declarations</h2>\n<p>Setting a static version (also called \"pinning\"), say <code>1.0.0</code>, mean's we only allow exactly that version (e.g. <code>1.0.0</code>).\nIn most cases, however, that is unnecessarily strict. Instead, we have three other options.\nWe can allow a range of patch / bug fix versions via <code>1.0</code>, <code>1.0.x</code>, or <code>~1.0.4</code>; a range of minor releases via <code>1</code>, <code>1.x</code>, <code>^1.0</code>, or <code>^1.0.0</code>; or, any version (major version qualifier) via <code>*</code> or <code>x</code>.\nCheck out <a href=\"https://docs.npmjs.com/about-semantic-versioning\">About semantic versioning</a> for a more in-depth description. It even includes a handy \"calculator\" to test your qualifiers.</p>\n<h1 id=\"user-content-id4\">Lockfiles</h1>\n<p>We have our dependency that we need, and we defined an acceptable version range; now, we need to resolve the actual version our project will use.\nThis is where a <a href=\"https://developer.mozilla.org/en-US/docs/Learn/Tools_and_testing/Understanding_client-side_tools/Package_management#what_exactly_is_a_package_manager\">package manager</a> comes in.\nYour favorite package manager (npm, yarn, etc.) will handle resolving the final versions, doing its best to have everyone play nicely in the sandbox, among other things.\nOnce it resolves everything to the best of its ability, a file is generated with this information. This file is known as a lockfile.</p>\n<h1 id=\"user-content-auditing-dependencies\">Auditing the dependency tree</h1>\n<p>From a performance perspective, we want to reduce the total weight of the dependency tree.\nStrategies to reduce bundle size include removing duplicates, swapping heavy libraries with lighter-weight equivalents, optimizations with compile-time transformers, and taking advantage of browser native functionality.</p>\n<h2 id=\"user-content-id5\">Duplicate dependencies</h2>\n<p>Due to the nature of version range declarations, we can run into conflicts with our transitive dependencies.</p>\n<p>Consider this trivial example:</p>\n<pre><code>- project\n  |\n  |--dependencyA@~1.5.0\n  |\n  |--dependencyB@...\n     |\n     |--dependencyA@1.4.0\n</code></pre>\n<p>This will introduce a duplicate of <code>dependencyA</code> at version <code>1.5.x</code> and <code>1.4.0</code></p>\n<p>Yarn, specifically, has some nifty tools to allow us to check for and address these conflicts.\nIn Yarn v1, you can use <a href=\"https://github.com/atlassian/yarn-deduplicate\">Atlassian's yarn-deduplicate</a>. <code>yarn-deduplicate --list yarn.lock</code> will show all duplicates, and <code>yarn-deduplicate yarn.lock</code> will attempt to fix them.\nYarn v2 <a href=\"https://yarnpkg.com/cli/dedupe\">supports deduplication natively</a>. <code>yarn dedupe --check</code> will show all duplicates, and <code>yarn dedupe</code> will attempt to fix them.</p>\n<p>If you're using NPM, you might consider trying something like the <a href=\"https://github.com/vovacodes/find-duplicate-dependencies\">find-duplicate-dependencies</a> package to find duplicates, and [https://docs.npmjs.com/cli/v8/commands/npm-dedupe](to de-dupe) them.</p>\n<p>All that said, you can, of course, inspect your lockfile manually and look for duplicate entries.</p>\n<h2 id=\"user-content-id6\">Addressing bloat</h2>\n<ul>\n<li>Upgrade dependencies to align versions</li>\n<li>Add <code>resolutions</code> to force dependency resolution</li>\n<li>Swap heavy libraries for lighter-weight libraries</li>\n<li>Check the size via <a href=\"https://bundlephobia.com/\">bundlephobia</a></li>\n<li>Webpack bundle analyzer</li>\n</ul>\n<h1 id=\"user-content-id7\">Best practices when creating a library</h1>\n<p>Do you currently maintain a library, or are you thinking of creating one? Here are some things to consider in order to help your fellow developers:</p>\n<ul>\n<li>Use || in versions to allow better auto-resolutions in host projects (where possible)</li>\n<li>Architect your code to be tree-shakable (allow cherry-picking imports // it is much easier to use a transformer plugin to fix imports with cherry-pick syntax)</li>\n</ul>\n","title":"Let's Talk Dependencies","date":""}},"__N_SSG":true}